apps/server/prisma/ERD.md
```mermaid
erDiagram
"user" {
  String id PK
  String email UK
  String name "nullable"
  String password
  DateTime created_at
  DateTime updated_at
  UserRole user_role
}
"user_setting" {
  String id PK
  String user_id FK
  String key
  String value
  DateTime created_at
  DateTime updated_at
}
"server_session" {
  String id PK
  String user_id FK
  String origin
  String server_token
  ServerType server_type
  DateTime created_at
  DateTime updated_at
}
"server_info" {
  String id PK
  String server_session_id FK
  String name
  String icon_url
  String favicon_url
  String theme_color
  DateTime created_at
  DateTime updated_at
}
"user_info" {
  String id PK
  String name
  String username
  String avater_url
  DateTime created_at
  DateTime updated_at
  String server_s_ession_id FK
  String userId FK "nullable"
}
"panel" {
  String id PK
  String server_session_id FK
  String type
}
"user_setting" }o--|| "user" : user
"server_session" }o--|| "user" : user
"server_info" |o--|| "server_session" : serverSession
"user_info" |o--|| "server_session" : serverSession
"user_info" }o--o| "user" : User
"panel" }o--|| "server_session" : serverSession
```
